app/Controllers/ProductController.php

        try {
            if ($productId) {
                // Update existing product
                $result = $this->productModel->update($productId, $data);
---
UPDATE `products` SET `category_id` = '1', `brand` = 'Asus', `title` = 'Asus Ultra Headphones 707', `description` = 'High-quality headphones from Asus. Perfect for gaming and professional use.', `meta_seo` = '', `features` = '', `price` = 146.8, `stock` = 30, `status` = 1, `updated_at` = '2025-08-12 11:48:36'
WHERE `products`.`id` IN ('39')


                log_message('debug', "Attempting to insert product with slug: {$data['slug']}");

                $productId = $this->productModel->insert($data);
---
INSERT INTO `products` (`category_id`, `brand`, `title`, `description`, `meta_seo`, `features`, `price`, `stock`, `status`, `slug`, `created_at`, `updated_at`) VALUES ('1', 'Asus', 'Asus Tuf Gaming Laptop', 'Asus Tuf Gaming Laptop,Ryzen 7, RTX 4050, and 16GB RAM', 'Asus Tuf Gaming Laptop,Ryzen 7, RTX 4050, and 16GB RAM', 'Asus Tuf Gaming Laptop,Ryzen 7, RTX 4050, and 16GB RAM,powerful performance at an affordable price', 190, 26, 1, 'asus-tuf-gaming-laptop-1755000329-766', '2025-08-12 12:05:29', '2025-08-12 12:05:29')

    public function getCartContents()
    {
        if (!$this->request->isAJAX()) {
            return $this->response->setJSON(['success' => false, 'message' => 'Invalid request']);
        }

        try {
            $userId = null; // TODO: Get from session when user auth is implemented
            $sessionId = session_id();

            // Get active cart
            $cart = $this->cartModel->where('status', 'active');
            if ($userId) {
                $cart->where('user_id', $userId);
            } else {
                $cart->where('session_id', $sessionId);
            }

            $cartData = $cart->first();
---
SELECT *
FROM `carts`
WHERE `status` = 'active'
AND `session_id` = ''
 LIMIT 1

    private function getCartItemCount(): int
    {
        try {
            $userId = null; // TODO: Get from session when user auth is implemented
            $sessionId = session_id();

            $cart = $this->cartModel->where('status', 'active');

            if ($userId) {
                $cart->where('user_id', $userId);
            } else {
                $cart->where('session_id', $sessionId);
            }

            $cartData = $cart->first();
---
SELECT *
FROM `carts`
WHERE `status` = 'active'
AND `session_id` = ''
 LIMIT 1