app/Models/CartItemModel.php

SELECT `cart_items`.*, `products`.`title`, `products`.`brand`, `products`.`stock`, `products`.`price` as `current_price`
FROM `cart_items`
JOIN `products` ON `products`.`id` = `cart_items`.`product_id`
WHERE `cart_items`.`cart_id` = '1'
AND `products`.`status` = 1
---
    public function getCartItems($cartId): array
    {
        return $this->select('cart_items.*, products.title, products.brand, products.stock, products.price as current_price')
                   ->join('products', 'products.id = cart_items.product_id')
                   ->where('cart_items.cart_id', $cartId)
                   ->where('products.status', 1)
                   ->findAll();

SELECT *
FROM `products`
WHERE `products`.`id` = 10
SELECT *
FROM `cart_items`
WHERE `cart_id` = '1'
AND `product_id` = 10
 LIMIT 1
---
    public function addOrUpdateItem($cartId, $productId, $quantity): array
    {
        // Get product to check stock and current price
        $productModel = new ProductModel();
        $product = $productModel->find($productId);

        if (!$product || $product['status'] != 1) {
            return [
                'success' => false,
                'message' => 'Product not found or inactive'
            ];
        }

        // Check stock availability
        if ($product['stock'] < $quantity) {
            return [
                'success' => false,
                'message' => "Only {$product['stock']} items available in stock",
                'max_quantity' => $product['stock']
            ];
        }

        // Check if item already exists in cart
        $existingItem = $this->where('cart_id', $cartId)
                            ->where('product_id', $productId)
                            ->first();

INSERT INTO `cart_items` (`cart_id`, `product_id`, `quantity`, `price`, `created_at`, `updated_at`) VALUES ('1', 10, 2, '190.00', '2025-08-12 16:15:45', '2025-08-12 16:15:45')
---
                'price' => $product['price']
            ];

            $itemId = $this->insert($itemData);

SELECT *
FROM `products`
WHERE `products`.`id` = 8
SELECT *
FROM `cart_items`
WHERE `cart_id` = '1'
AND `product_id` = 8
 LIMIT 1
---
    public function updateQuantity($cartId, $productId, $quantity): array
    {
        if ($quantity <= 0) {
            return $this->removeItem($cartId, $productId);
        }

        // Get product to check stock
        $productModel = new ProductModel();
        $product = $productModel->find($productId);

        if (!$product || $product['status'] != 1) {
            return [
                'success' => false,
                'message' => 'Product not found or inactive'
            ];
        }

        if ($quantity > $product['stock']) {
            return [
                'success' => false,
                'message' => "Only {$product['stock']} items available in stock",
                'max_quantity' => $product['stock']
            ];
        }

        $item = $this->where('cart_id', $cartId)
                    ->where('product_id', $productId)
                    ->first();

UPDATE `cart_items` SET `quantity` = 1, `price` = '3500.00', `updated_at` = '2025-08-12 16:15:48'
WHERE `cart_items`.`id` IN ('7')
---
            ];
        }

        $this->update($item['id'], [
            'quantity' => $quantity,
            'price' => $product['price'] // Update to current price
        ]);

SELECT SUM(`quantity`) AS `quantity`
FROM `cart_items`
WHERE `cart_id` = '1'
 LIMIT 1
---
    public function getCartItemCount($cartId): int
    {
        $result = $this->selectSum('quantity')
                      ->where('cart_id', $cartId)
                      ->first();