app/Models/CartModel.php

    public function getActiveCart($userId = null, $sessionId = null): ?array
    {
        $builder = $this->where('status', 'active');

        if ($userId) {
            $builder->where('user_id', $userId);
        } else {
            $builder->where('session_id', $sessionId);
        }

        $cart = $builder->first();
---
SELECT *
FROM `carts`
WHERE `status` = 'active'
AND `session_id` = ''
 LIMIT 1

    public function getCartWithItems($cartId): array
    {
        $cart = $this->find($cartId);
---
SELECT *
FROM `carts`
WHERE `carts`.`id` = '1'