app/Models/CategoryModel.php

SELECT *
FROM `categories`
WHERE `status` = 1
---
    public function getActiveCategories()
    {
        return $this->where('status', 1)->findAll();