app/Models/ProductModel.php

    public function searchProducts($query, $limit = 10)
    {
        if (empty($query)) {
            return $this->where('status', 1)->limit($limit)->findAll();
        }

        $builder = $this->select('products.*, categories.name as category_name')
                        ->join('categories', 'categories.id = products.category_id', 'left')
                        ->where('products.status', 1);

        // Simple but effective search across all fields
        $builder->groupStart();

        // Search in title
        $builder->like('products.title', $query);

        // Search in brand
        $builder->orLike('products.brand', $query);

        // Search in description
        $builder->orLike('products.description', $query);

        // Search in features
        $builder->orLike('products.features', $query);

        // Search in category name
        $builder->orLike('categories.name', $query);

        $builder->groupEnd();

        return $builder->limit($limit)->findAll();
---
SELECT `products`.*, `categories`.`name` as `category_name`
FROM `products`
LEFT JOIN `categories` ON `categories`.`id` = `products`.`category_id`
WHERE `products`.`status` = 1
AND   (
`products`.`title` LIKE '%asus%' ESCAPE '!'
OR  `products`.`brand` LIKE '%asus%' ESCAPE '!'
OR  `products`.`description` LIKE '%asus%' ESCAPE '!'
OR  `products`.`features` LIKE '%asus%' ESCAPE '!'
OR  `categories`.`name` LIKE '%asus%' ESCAPE '!'
 )
 LIMIT 20

    public function getProductWithCategory($id)
    {
        return $this->select('products.*, categories.name as category_name')
                    ->join('categories', 'categories.id = products.category_id', 'left')
                    ->find($id);
---
SELECT `products`.*, `categories`.`name` as `category_name`
FROM `products`
LEFT JOIN `categories` ON `categories`.`id` = `products`.`category_id`
WHERE `products`.`id` = '8'

    public function generateSlug($title, $id = null)
    {
        // Create base slug
        $baseSlug = url_title($title, '-', true);

        // Always add timestamp and random to ensure uniqueness
        $timestamp = time();
        $random = rand(100, 999);
        $slug = $baseSlug . '-' . $timestamp . '-' . $random;

        // Double check for absolute uniqueness
        $counter = 1;
        $originalSlug = $slug;

        while ($counter <= 10) {
            $query = $this->db->table('products')
                             ->select('id')
                             ->where('slug', $slug);

            if ($id) {
                $query->where('id !=', $id);
            }

            $result = $query->get();
---
SELECT `id`
FROM `products`
WHERE `slug` = 'asus-tuf-gaming-laptop-1755000329-766'